Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходнаяНакладная</Name>
		</Properties>
	</Document>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
&Вместо("СписокВыбор")
Процедура АС_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Неопределено Или Поле.Имя <> "АС_СоставПриходнойНакладной" Тогда
		ПродолжитьВызов(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	СоставНакладной = АС_ПолучитьСоставПриходнойНакладной(Элемент.ТекущиеДанные.Ссылка);
	Если СоставНакладной.Количество() = 0 Тогда
		ТекстНетТоваров = НСтр("ru = 'Товары в приходной накладной отсутствуют'");
		СоставНакладной.Добавить(ТекстНетТоваров, ТекстНетТоваров);
	КонецЕсли;

	АС_РасширитьПредставлениеСоставаЗаказа(СоставНакладной);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("АС_СоставЗаказаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеОЗакрытии, СоставНакладной, Поле);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьСоставПриходнойНакладной(ПриходнаяНакладная)

	СоставНакладной = Новый СписокЗначений;
	Если Не ЗначениеЗаполнено(ПриходнаяНакладная) Тогда
		Возврат СоставНакладной;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  Запасы.НомерСтроки КАК НомерСтроки,
	|  Запасы.Номенклатура.Артикул КАК Артикул,
	|  Запасы.Номенклатура.Наименование КАК Наименование,
	|  Запасы.Количество КАК Количество
	|ИЗ
	|  Документ.ПриходнаяНакладная.Запасы КАК Запасы
	|ГДЕ
	|  Запасы.Ссылка = &ПриходнаяНакладная
	|  И Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|УПОРЯДОЧИТЬ ПО
	|  НомерСтроки";
	Запрос.УстановитьПараметр("ПриходнаяНакладная", ПриходнаяНакладная);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Артикул = СокрЛП(Выборка.Артикул);
		Количество = СокрЛП(Строка(Выборка.Количество)) + " шт.";
		Если ПустаяСтрока(Артикул) Тогда
			ТекстСтроки = СтрШаблон("%1 | %2", Выборка.Наименование, Количество);
		Иначе
			ТекстСтроки = СтрШаблон("%1 | %2 | %3", Артикул, Выборка.Наименование, Количество);
		КонецЕсли;
		СоставНакладной.Добавить(ТекстСтроки, ТекстСтроки);
	КонецЦикла;

	Возврат СоставНакладной;

КонецФункции

&НаКлиенте
Процедура АС_СписокЗаказыПоставщикамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя <> "АС_СоставЗаказаПоставщику" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СоставЗаказа = АС_ПолучитьСоставЗаказаПоставщику(Элемент.ТекущиеДанные.Ссылка);
	Если СоставЗаказа.Количество() = 0 Тогда
		ТекстНетТоваров = НСтр("ru = 'Заказанные товары отсутствуют'");
		СоставЗаказа.Добавить(ТекстНетТоваров, ТекстНетТоваров);
	КонецЕсли;
	
	АС_РасширитьПредставлениеСоставаЗаказа(СоставЗаказа);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("АС_СоставЗаказаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеОЗакрытии, СоставЗаказа, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура АС_РасширитьПредставлениеСоставаЗаказа(СоставЗаказа)
	
	МаксимальнаяДлина = 0;
	СамаяДлиннаяСтрока = Неопределено;
	Для Каждого СтрокаСостава Из СоставЗаказа Цикл
		ДлинаСтроки = СтрДлина(СтрокаСостава.Представление);
		Если ДлинаСтроки > МаксимальнаяДлина Тогда
			МаксимальнаяДлина = ДлинаСтроки;
			СамаяДлиннаяСтрока = СтрокаСостава;
		КонецЕсли;
	КонецЦикла;
	
	Если СамаяДлиннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заполнитель = "";
	Для ИндексСимвола = 1 По МаксимальнаяДлина * 2 Цикл
		Заполнитель = Заполнитель + Символ(160);
	КонецЦикла;
	СамаяДлиннаяСтрока.Представление = СамаяДлиннаяСтрока.Представление + Заполнитель;
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СоставЗаказаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьСоставЗаказаПоставщику(ЗаказПоставщику)
	
	СоставЗаказа = Новый СписокЗначений;
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат СоставЗаказа;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  Запасы.НомерСтроки КАК НомерСтроки,
	|  Запасы.Номенклатура.Артикул КАК Артикул,
	|  Запасы.Номенклатура.Наименование КАК Наименование,
	|  Запасы.Количество КАК Количество
	|ИЗ
	|  Документ.ЗаказПоставщику.Запасы КАК Запасы
	|ГДЕ
	|  Запасы.Ссылка = &ЗаказПоставщику
	|  И Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|УПОРЯДОЧИТЬ ПО
	|  НомерСтроки";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Артикул = СокрЛП(Выборка.Артикул);
		Количество = СокрЛП(Строка(Выборка.Количество)) + " шт.";
		Если ПустаяСтрока(Артикул) Тогда
			ТекстСтроки = СтрШаблон("%1 | %2",
				Выборка.Наименование,
				Количество);
		Иначе
			ТекстСтроки = СтрШаблон("%1 | %2 | %3",
				Артикул,
				Выборка.Наименование,
				Количество);
		КонецЕсли;
		СоставЗаказа.Добавить(ТекстСтроки, ТекстСтроки);
	КонецЦикла;
	
	Возврат СоставЗаказа;
	
КонецФункции
